# Introduction to Pandas Library
- Pandas is an open source library in python which is know for its rich applications and utilities for all kinds of mathematical, financial and statistical functions
- It is useful in data manipulation and analysis
- It provides fast, flexible, and expressive data structures designed to make working with structured (tabular, multidimensional, potentially heterogeneous) and time series data

#### Installing pandas

In [ ]:
!pip install pandas

#### Importing pandas

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

### Comparision between Arrays, Series and Dataframes

<table style="width: 70%; border-collapse: collapse; border: 1px solid #ccc; text-align: left; float: left;">
    <thead>
        <tr style="background-color: #050A30; color: white;">
            <th style="width: 20%;">Type</th>
            <th>Description</th>
        </tr>
    </thead>
    <tbody>
        <tr>
            <td>Arrays</td>
            <td>
                <ul>
                    <li>1D datastructure</li>
                    <li>Belongs to numpy library</li>
                    <li>Compatible with all numpy functions</li>
                    <li>Use matplotlib/seaborn to visualize arrays</li>
                </ul>
            </td>
        </tr>
        <tr>
            <td>Series</td>
            <td>
                <ul>
                    <li>1D datastructure</li>
                    <li>Belongs to pandas library</li>
                    <li>Compatible with all numpy and most of pandas functions</li>
                    <li>Use ser_obj.to_frame() to convert to 2D object if needed</li>
                </ul>
            </td>
        </tr>
        <tr>
            <td>Dataframes</td>
            <td>
                <ul>
                    <li>2D datastructure</li>
                    <li>Belongs to pandas library</li>
                    <li>Compatible with all numpy and pandas functions</li>
                    <li>Each column from dataframe is a series object</li>
                </ul>
            </td>
        </tr>
    </tbody>
</table>

###### Example -

In [2]:
employees = {"Name" : ["Jack", "Bill", "Lizie", "Jane", "George"],
            "Designation" : ["HR", "Manager", "Developer", "Intern", "Manager"],
            "Salary": [40000, 60000, 25000, 12000, 70000]}

df = pd.DataFrame(employees)
df

     Name Designation  Salary
0    Jack          HR   40000
1    Bill     Manager   60000
2   Lizie   Developer   25000
3    Jane      Intern   12000
4  George     Manager   70000

In [3]:
df.Name # series object - 1D object

0      Jack
1      Bill
2     Lizie
3      Jane
4    George
Name: Name, dtype: object

In [6]:
df.iloc[0] # series object

Name            Jack
Designation       HR
Salary         40000
Name: 0, dtype: object

In [8]:
df.Name.to_frame()  # single column dataframe - 2D object

     Name
0    Jack
1    Bill
2   Lizie
3    Jane
4  George

In [9]:
df.Name.to_numpy()  # 1D - Array

array(['Jack', 'Bill', 'Lizie', 'Jane', 'George'], dtype=object)

In [10]:
df.to_numpy()  # 2D Array

array([['Jack', 'HR', 40000],
       ['Bill', 'Manager', 60000],
       ['Lizie', 'Developer', 25000],
       ['Jane', 'Intern', 12000],
       ['George', 'Manager', 70000]], dtype=object)

#### Creating Dataframes

In [11]:
employees = {"Name" : ["Jack", "Bill", "Lizie", "Jane", "George"],
            "Designation" : ["HR", "Manager", "Developer", "Intern", "Manager"],
            "Salary": [40000, 60000, 25000, 12000, 70000]}

df = pd.DataFrame(employees)
df

     Name Designation  Salary
0    Jack          HR   40000
1    Bill     Manager   60000
2   Lizie   Developer   25000
3    Jane      Intern   12000
4  George     Manager   70000

#### Accessing Dataframes

###### Ex. Extarct Name column

In [12]:
df.Name

0      Jack
1      Bill
2     Lizie
3      Jane
4    George
Name: Name, dtype: object

In [13]:
df["Name"]

0      Jack
1      Bill
2     Lizie
3      Jane
4    George
Name: Name, dtype: object

###### Ex. Extract Name and Designation

In [14]:
df[["Name", "Designation"]]

     Name Designation
0    Jack          HR
1    Bill     Manager
2   Lizie   Developer
3    Jane      Intern
4  George     Manager

#### Modifying Column Labels

In [15]:
df.columns

Index(['Name', 'Designation', 'Salary'], dtype='object')

In [16]:
df.columns = ["EName", "Designation", "Base Salary"]

In [17]:
df

    EName Designation  Base Salary
0    Jack          HR        40000
1    Bill     Manager        60000
2   Lizie   Developer        25000
3    Jane      Intern        12000
4  George     Manager        70000

#### Rename specific column names

In [21]:
df.rename({"EName" : "Name"}, axis=1)

     Name Designation  Base Salary
0    Jack          HR        40000
1    Bill     Manager        60000
2   Lizie   Developer        25000
3    Jane      Intern        12000
4  George     Manager        70000

In [22]:
df

    EName Designation  Base Salary
0    Jack          HR        40000
1    Bill     Manager        60000
2   Lizie   Developer        25000
3    Jane      Intern        12000
4  George     Manager        70000

##### Note - Many pandas will return new df object without modifying the original ones. To modify the original df use `inplace = True`

In [23]:
df.rename({"EName" : "Name"}, axis=1, inplace=True)
df

     Name Designation  Base Salary
0    Jack          HR        40000
1    Bill     Manager        60000
2   Lizie   Developer        25000
3    Jane      Intern        12000
4  George     Manager        70000

#### Setting and Re-setting index labels

- `df.set_index(keys, drop=True, inplace=False,)`- Set the DataFrame index (row labels) using one or more existing columns or arrays (of the correct length). The index can replace the existing index or expand on it.
- `df.reset_index(level=None, drop=False, inplace=False,)` - Reset the index of the DataFrame, and use the default one instead. If the DataFrame has a MultiIndex, this method can remove one or more levels.

In [25]:
df.set_index("Name", inplace=True)
df

       Designation  Base Salary
Name
Jack            HR        40000
Bill       Manager        60000
Lizie    Developer        25000
Jane        Intern        12000
George     Manager        70000

In [26]:
df.reset_index(inplace=True)

###### Ex. Set designation as index label

In [27]:
df.set_index("Designation", inplace=True)
df

               Name  Base Salary
Designation
HR             Jack        40000
Manager        Bill        60000
Developer     Lizie        25000
Intern         Jane        12000
Manager      George        70000

#### Indexing and Slicing on DataFrames
1. Based on labels - loc
2. Based on index positions - iloc

###### Ex. Extract data for Managers

In [28]:
df.loc["Manager"]

               Name  Base Salary
Designation
Manager        Bill        60000
Manager      George        70000

###### Ex. Extract data for Managers and HR

In [29]:
df.loc[["Manager", "HR"]]

               Name  Base Salary
Designation
Manager        Bill        60000
Manager      George        70000
HR             Jack        40000

###### Ex. Extract Salary data for Managers and HR

In [30]:
df.loc[["Manager", "HR"], "Base Salary"]

Designation
Manager    60000
Manager    70000
HR         40000
Name: Base Salary, dtype: int64

###### Ex. Extract data for row index 2

In [31]:
df.iloc[2]

Name           Lizie
Base Salary    25000
Name: Developer, dtype: object

###### Ex. Extract data for row index 1 to 3

In [33]:
df.iloc[1:4]

              Name  Base Salary
Designation
Manager       Bill        60000
Developer    Lizie        25000
Intern        Jane        12000

###### Ex. Reset the datafram

In [34]:
df.reset_index(inplace=True)

In [35]:
df

  Designation    Name  Base Salary
0          HR    Jack        40000
1     Manager    Bill        60000
2   Developer   Lizie        25000
3      Intern    Jane        12000
4     Manager  George        70000

#### Filtering Dataframes

###### Ex. Extract salary > 50000

In [37]:
df[df["Base Salary"] > 50000]

  Designation    Name  Base Salary
1     Manager    Bill        60000
4     Manager  George        70000

###### Ex. Extract salary between 20000 to 50000

In [38]:
df[df["Base Salary"].between(20000, 50000)]

  Designation   Name  Base Salary
0          HR   Jack        40000
2   Developer  Lizie        25000

###### Ex. Extract designation either as HR or Developer

In [39]:
df[df["Designation"].isin(["HR", "Developer"])]

  Designation   Name  Base Salary
0          HR   Jack        40000
2   Developer  Lizie        25000

###### Ex. Extract employees who name starts with J

In [41]:
df[df["Name"].str.startswith("J")]

  Designation  Name  Base Salary
0          HR  Jack        40000
3      Intern  Jane        12000

###### Ex. Modify the salary of all employees to 80000 whose original salary is > 300000

In [47]:
df["Base Salary"][df["Base Salary"] > 30000] = 80000  # DO not use this syntax to modify

C:\Users\vaide\AppData\Local\Temp\ipykernel_64488\501708486.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Base Salary"][df["Base Salary"] > 30000] = 80000
C:\Users\vaide\AppData\Local\Temp\ipykernel_64488\501708486.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Base Salary"][df["Base Salary"] > 30000] = 80000

In [49]:
df.loc[df["Base Salary"] > 30000, "Base Salary"] = 90000  # Right syntx to modify part of the df based on filter

In [50]:
df

  Designation    Name  Base Salary
0          HR    Jack        90000
1     Manager    Bill        90000
2   Developer   Lizie        25000
3      Intern    Jane        12000
4     Manager  George        90000

#### Operations on dataframes

###### Ex. Average Salary

In [51]:
df["Base Salary"].mean()

np.float64(61400.0)

###### Ex. Average Salary of managers

In [52]:
df["Base Salary"][df["Designation"] == "Manager"].mean()

np.float64(90000.0)

In [54]:
df[df["Designation"] == "Manager"]["Base Salary"].mean()

np.float64(90000.0)

### Concataneting and Merging Dataframes

In [55]:
df_jan = pd.DataFrame({"Order ID" : range(101, 104), "Sales" : np.random.randint(10000, 50000, 3)})
df_feb = pd.DataFrame({"Order ID" : range(111, 114), "Sales" : np.random.randint(10000, 50000, 3)})
df_mar = pd.DataFrame({"Order ID" : range(121, 124), "Sales" : np.random.randint(10000, 50000, 3)})

In [56]:
df_jan

   Order ID  Sales
0       101  15563
1       102  38572
2       103  23677

#### Concatenate
pd.concat(`tuple of dfs`, `ignore_index = False`, `axis=0`)

In [58]:
pd.concat((df_jan, df_feb, df_mar), ignore_index=True)

   Order ID  Sales
0       101  15563
1       102  38572
2       103  23677
3       111  24844
4       112  35513
5       113  10555
6       121  49088
7       122  47468
8       123  31141

#### Merging Dataframes

`df1.merge(df2, how="", on = "", left_on="", right_on="", left_index= "" , right_index="")`

In [59]:
df_emp = pd.DataFrame({"Name" : ["Jack", "Bill", "Lizie", "Jane", "George"],
            "Designation" : ["HR", "Manager", "Developer", "Intern", "Manager"]})
df_emp

     Name Designation
0    Jack          HR
1    Bill     Manager
2   Lizie   Developer
3    Jane      Intern
4  George     Manager

In [60]:
base_salaries = pd.DataFrame({"Designation" : ["HR", "Developer", "Manager", "Senior Manager"],
            "Salary": [40000, 25000, 70000, 1000000]})
base_salaries

      Designation   Salary
0              HR    40000
1       Developer    25000
2         Manager    70000
3  Senior Manager  1000000

#### Inner Merge

In [61]:
df_emp.merge(base_salaries, how="inner", on = "Designation")  # returns only common rows

     Name Designation  Salary
0    Jack          HR   40000
1    Bill     Manager   70000
2   Lizie   Developer   25000
3  George     Manager   70000

#### Left Merge

In [63]:
df_emp.merge(base_salaries, how="left", on = "Designation")  # returns all rows from left table

     Name Designation   Salary
0    Jack          HR  40000.0
1    Bill     Manager  70000.0
2   Lizie   Developer  25000.0
3    Jane      Intern      NaN
4  George     Manager  70000.0

#### Right Merge

In [64]:
df_emp.merge(base_salaries, how="right", on = "Designation")  # returns all rows from right table

     Name     Designation   Salary
0    Jack              HR    40000
1   Lizie       Developer    25000
2    Bill         Manager    70000
3  George         Manager    70000
4     NaN  Senior Manager  1000000

#### Outer Merge

In [62]:
df_emp.merge(base_salaries, how="outer", on = "Designation")  # returns all rows from both tables

     Name     Designation     Salary
0   Lizie       Developer    25000.0
1    Jack              HR    40000.0
2    Jane          Intern        NaN
3    Bill         Manager    70000.0
4  George         Manager    70000.0
5     NaN  Senior Manager  1000000.0

<hr><hr>

## Reading data from external datasources

### Using `os` Library to set path

In [65]:
import os
os.getcwd()

'C:\\Users\\vaide\\OneDrive - knowledgecorner.in\\Course Material\\Clients\\Optum Global\\2025_12_Feb_Python-Data_Viz_analytics\\Classwork'

In [66]:
os.chdir("./datasets")

In [67]:
os.getcwd()

'C:\\Users\\vaide\\OneDrive - knowledgecorner.in\\Course Material\\Clients\\Optum Global\\2025_12_Feb_Python-Data_Viz_analytics\\Classwork\\datasets'

### Read data from Database

- Syntax - dialect+driver://username:password@host:port/database
            
- Mysql - "mysql+pymysql://root:1234@localhost:3306/onlineshopping"
- Oracle - "oracle+cx_oracle://s:t@dsn"

In [ ]:
!pip install sqlalchemy

In [68]:
from sqlalchemy import create_engine
conn = create_engine(r"sqlite:///employee.sqlite3")
conn

Engine(sqlite:///employee.sqlite3)

In [70]:
df = pd.read_sql("Employee", conn)
df

         Name  Salary        Designation  Age
0      Claire   88962            Manager   35
1      Darrin   67659          Team Lead   26
2        Sean  117501            Manager   36
3     Brosina  149957     Senior Manager   44
4      Andrew   32212          Team Lead   33
5       Irene   63391          Team Lead   33
6      Harold   14438          Developer   23
7        Pete   22445          Developer   22
8   Alejandro   72287          Team Lead   35
9    Zuschuss  195588  Managing Director   53
10        Ken   17240          Developer   25
11     Sandra  115116            Manager   41
12      Emily   18027          Developer   24
13       Eric   55891          Team Lead   31
14      Tracy  109132            Manager   34
15       Matt   83327            Manager   43
16       Gene   22125          Developer   22
17      Steve   29324          Team Lead   29
18      Linda   54003          Team Lead   35
19      Ruben   18390          Developer   25
20       Erin  141401     Senior Manager   47
21     Odella   19593          Developer   22
22    Patrick   57093          Team Lead   26
23       Lena  130556     Senior Manager   52
24     Darren   22093          Developer   25
25      Janet   13058          Developer   25
26        Ted   26180          Team Lead   27
27      Kunst   23259          Developer   24
28       Paul   34248          Team Lead   27
29    Brendan   27416          Team Lead   30

###### Ex. Write data to database - create a new table Managers

In [86]:
df[df.Designation == "Manager"].to_sql("Managers", conn, if_exists="replace", index=False)

5

In [88]:
df_managers = pd.read_sql("Managers", conn)
df_managers

     Name  Salary Designation  Age
0  Claire   88962     Manager   35
1    Sean  117501     Manager   36
2  Sandra  115116     Manager   41
3   Tracy  109132     Manager   34
4    Matt   83327     Manager   43

In [89]:
new_managers = pd.DataFrame({"Name" :["Jane", "Jack"], "Salary" : [60000, 70000], "Designation" : ["Manager", "Manager"], "Age" : [40, 41]})
new_managers = pd.concat((new_managers, df_managers))
new_managers

     Name  Salary Designation  Age
0    Jane   60000     Manager   40
1    Jack   70000     Manager   41
0  Claire   88962     Manager   35
1    Sean  117501     Manager   36
2  Sandra  115116     Manager   41
3   Tracy  109132     Manager   34
4    Matt   83327     Manager   43

In [90]:
new_managers.to_sql("Managers", conn, if_exists="replace", index=False)

7

In [91]:
pd.read_sql("Managers", conn)

     Name  Salary Designation  Age
0    Jane   60000     Manager   40
1    Jack   70000     Manager   41
2  Claire   88962     Manager   35
3    Sean  117501     Manager   36
4  Sandra  115116     Manager   41
5   Tracy  109132     Manager   34
6    Matt   83327     Manager   43

### Read data from api using json object

In [93]:
import requests
response = requests.get(r"http://127.0.0.1:5000/tasks")
response

In [94]:
response.json()

{'TaskNo': [1, 2, 3],
 'Task': ['Flask Project', 'Meeting at 3', 'Pandas api connection'],
 'Created_date': ['2023-09-15 10:00:25.116253',
  '2023-09-15 13:49:46.580811',
  '2025-02-13 13:39:34.576229'],
 'Due_date': ['2023-09-16 00:00:00',
  '2023-09-17 00:00:00',
  '2025-02-13 00:00:00'],
 'Status': ['Complete', 'In-Progress', 'In-Progress']}

In [95]:
pd.DataFrame(response.json())

,TaskNo,Task,Created_date,Due_date,Status
0,1,Flask Project,2023-09-15 10:00:25.116253,2023-09-16 00:00:00,Complete
1,2,Meeting at 3,2023-09-15 13:49:46.580811,2023-09-17 00:00:00,In-Progress
2,3,Pandas api connection,2025-02-13 13:39:34.576229,2025-02-13 00:00:00,In-Progress

In [96]:
df = pd.DataFrame(response.json())
df

,TaskNo,Task,Created_date,Due_date,Status
0,1,Flask Project,2023-09-15 10:00:25.116253,2023-09-16 00:00:00,Complete
1,2,Meeting at 3,2023-09-15 13:49:46.580811,2023-09-17 00:00:00,In-Progress
2,3,Pandas api connection,2025-02-13 13:39:34.576229,2025-02-13 00:00:00,In-Progress

In [97]:
df.to_json()

'{"TaskNo":{"0":1,"1":2,"2":3},"Task":{"0":"Flask Project","1":"Meeting at 3","2":"Pandas api connection"},"Created_date":{"0":"2023-09-15 10:00:25.116253","1":"2023-09-15 13:49:46.580811","2":"2025-02-13 13:39:34.576229"},"Due_date":{"0":"2023-09-16 00:00:00","1":"2023-09-17 00:00:00","2":"2025-02-13 00:00:00"},"Status":{"0":"Complete","1":"In-Progress","2":"In-Progress"}}'

### Read data from Sharepoint/Googlesheets

In [ ]:
pip install pandas Office365-REST-Python-Client

In [ ]:
from office365.sharepoint.client_context import ClientContext
from office365.runtime.auth.client_credential import ClientCredential

# Replace with your SharePoint site URL, client ID, and client secret
site_url = "https://example.sharepoint.com/sites/YourSite"
client_id = "your_client_id"
client_secret = "your_client_secret"

# Authenticate and connect
ctx = ClientContext(site_url).with_credentials(ClientCredential(client_id, client_secret))

In [ ]:
from io import BytesIO
import pandas as pd

# Replace with the relative URL of your SharePoint file
file_url = "/sites/YourSite/Shared Documents/yourfile.xlsx"

response = ctx.web.get_file_by_server_relative_url(file_url).download_as_stream().execute_query()

# Load the file into a pandas DataFrame
file_stream = BytesIO(response.content)
df = pd.read_excel(file_stream)

print(df)

<hr><hr>

### Save the Data to json/csv/excel

##### Note - to connect to excel; openpyxl library is needed

In [ ]:
pip install openpyxl

## Data Manipulation using `pandas`

###### Ex. Read data from coffee_sales.csv

In [101]:
df = pd.read_csv("coffee_sales.csv", header=3)
df.head()

,Unnamed: 0,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales
0,NaN,1-Jan-21,M1,Mumbai,Amaretto,$219.00,$94.00,$100.00,$220.00
1,NaN,1-Feb-21,M1,Mumbai,Amaretto,$140.00,$34.00,$50.00,$140.00
2,NaN,1-Mar-21,M1,Mumbai,Amaretto,$145.00,-$2.00,$30.00,$180.00
3,NaN,1-Apr-21,M1,Mumbai,Amaretto,$45.00,$11.00,$20.00,$40.00
4,NaN,1-May-21,M1,Mumbai,Amaretto,$120.00,$13.00,$30.00,$120.00

#### Check for null values
`df.isna()` - Detect missing values. Return a boolean same-sized object indicating if the values are NA.

In [103]:
df.isna().any()  # Returns True if a column contains atleast 1 null value

Unnamed: 0        True
Date             False
Franchise        False
City             False
Product          False
Sales            False
Profit           False
Target Profit     True
Target Sales     False
dtype: bool

In [104]:
df.isna().sum() # returns count of null values in each column

Unnamed: 0       4248
Date                0
Franchise           0
City                0
Product             0
Sales               0
Profit              0
Target Profit     188
Target Sales        0
dtype: int64

#### Remove/Replace nulls

- `df.fillna(value=None, inplace=False)` - Fill NA/NaN values using the specified method.
- `df.dropna(axis = 0, how = "any", inplace = False)`
    - axis 0 for row or 1 for column
    - how - {any or all}

In [106]:
df.dropna(how = "all")  # Drop null rows with all null columns

,Unnamed: 0,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales
0,NaN,1-Jan-21,M1,Mumbai,Amaretto,$219.00,$94.00,$100.00,$220.00
1,NaN,1-Feb-21,M1,Mumbai,Amaretto,$140.00,$34.00,$50.00,$140.00
2,NaN,1-Mar-21,M1,Mumbai,Amaretto,$145.00,-$2.00,$30.00,$180.00
3,NaN,1-Apr-21,M1,Mumbai,Amaretto,$45.00,$11.00,$20.00,$40.00
4,NaN,1-May-21,M1,Mumbai,Amaretto,$120.00,$13.00,$30.00,$120.00
...,...,...,...,...,...,...,...,...,...
4243,NaN,1-Aug-26,M1,Mumbai,Regular Espresso,$719.00,$565.00,$390.00,$660.00
4244,NaN,1-Sep-26,M1,Mumbai,Regular Espresso,$81.00,-$4.00,$10.00,$70.00
4245,NaN,1-Oct-26,M1,Mumbai,Regular Espresso,$326.00,$129.00,$80.00,$290.00
4246,NaN,1-Nov-26,M1,Mumbai,Regular Espresso,$700.00,$463.00,$320.00,$640.00
4247,NaN,1-Dec-26,M1,Mumbai,Regular Espresso,$48.00,-$24.00,$10.00,$40.00

In [109]:
df.dropna(axis = 1, how = "all", inplace = True)  # Drop null cols with all null values
df.head()

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales
0,1-Jan-21,M1,Mumbai,Amaretto,$219.00,$94.00,$100.00,$220.00
1,1-Feb-21,M1,Mumbai,Amaretto,$140.00,$34.00,$50.00,$140.00
2,1-Mar-21,M1,Mumbai,Amaretto,$145.00,-$2.00,$30.00,$180.00
3,1-Apr-21,M1,Mumbai,Amaretto,$45.00,$11.00,$20.00,$40.00
4,1-May-21,M1,Mumbai,Amaretto,$120.00,$13.00,$30.00,$120.00

In [111]:
df["Target Profit"].fillna("0", inplace=True)  # depricated

C:\Users\vaide\AppData\Local\Temp\ipykernel_64488\3161871337.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Target Profit"].fillna("0", inplace=True)

In [112]:
df.fillna({"Target Profit": "0"}, inplace=True)  # new syntax

##### Note - 
This is older syntax. New syntax to be followed is - `df.method({col: value}, inplace=True)`

#### Handing duplicates

In [115]:
df.duplicated().any()

np.False_

In [ ]:
df.drop_duplicates()  # drop duplicate rows

#### Drop column from a df

In [118]:
df.drop(columns=["City"])

,Date,Franchise,Product,Sales,Profit,Target Profit,Target Sales
0,1-Jan-21,M1,Amaretto,$219.00,$94.00,$100.00,$220.00
1,1-Feb-21,M1,Amaretto,$140.00,$34.00,$50.00,$140.00
2,1-Mar-21,M1,Amaretto,$145.00,-$2.00,$30.00,$180.00
3,1-Apr-21,M1,Amaretto,$45.00,$11.00,$20.00,$40.00
4,1-May-21,M1,Amaretto,$120.00,$13.00,$30.00,$120.00
...,...,...,...,...,...,...,...
4243,1-Aug-26,M1,Regular Espresso,$719.00,$565.00,$390.00,$660.00
4244,1-Sep-26,M1,Regular Espresso,$81.00,-$4.00,$10.00,$70.00
4245,1-Oct-26,M1,Regular Espresso,$326.00,$129.00,$80.00,$290.00
4246,1-Nov-26,M1,Regular Espresso,$700.00,$463.00,$320.00,$640.00
4247,1-Dec-26,M1,Regular Espresso,$48.00,-$24.00,$10.00,$40.00

#### Data Cleaning

###### Ex. Convert all numeric column to float

In [120]:
df.dtypes

Date             object
Franchise        object
City             object
Product          object
Sales            object
Profit           object
Target Profit    object
Target Sales     object
dtype: object

In [129]:
df.Sales = df.Sales.str.replace("$", "").astype(float)
df.Profit = df.Profit.str.replace("$", "").astype(float)
df["Target Profit"] = df["Target Profit"].str.replace("$", "").astype(float)
df["Target Sales"] = df["Target Sales"].str.replace("$", "").str.replace(",", "").astype(float)

In [130]:
df.head()

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales
0,1-Jan-21,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0
1,1-Feb-21,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0
2,1-Mar-21,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0
3,1-Apr-21,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0
4,1-May-21,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0

In [132]:
df.Sales.sum()

np.float64(819811.0)

#### Add Column by calculation to the dataframe

###### Ex. Check the status of target sales and add it to the dataframe as a new column

In [134]:
df["Target Status"] = np.where(df.Sales >= df["Target Sales"], "Achieved", "Not Achieved")
df.head()

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Target Status
0,1-Jan-21,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not Achieved
1,1-Feb-21,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0,Achieved
2,1-Mar-21,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0,Not Achieved
3,1-Apr-21,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0,Achieved
4,1-May-21,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0,Achieved

#### Working with date column

###### Ex. Convert date column to date type

In [136]:
df["Date"] = pd.to_datetime(df.Date, format= "mixed")
df.head()

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Target Status
0,2021-01-01,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not Achieved
1,2021-02-01,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0,Achieved
2,2021-03-01,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0,Not Achieved
3,2021-04-01,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0,Achieved
4,2021-05-01,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0,Achieved

###### Ex. Extract data for year 2021

In [138]:
df[df.Date == "2021"]

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Target Status
0,2021-01-01,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not Achieved
72,2021-01-01,M2,Mumbai,Amaretto,302.0,133.0,160.0,300.0,Achieved
144,2021-01-01,M3,Mumbai,Amaretto,254.0,153.0,120.0,260.0,Not Achieved
216,2021-01-01,M1,Mumbai,Caffe Latte,180.0,53.0,50.0,150.0,Achieved
288,2021-01-01,M2,Mumbai,Caffe Latte,150.0,39.0,40.0,120.0,Achieved
360,2021-01-01,B1,Banglore,Caffe Latte,159.0,61.0,50.0,130.0,Achieved
432,2021-01-01,M1,Mumbai,Caffe Mocha,134.0,54.0,70.0,150.0,Not Achieved
504,2021-01-01,M2,Mumbai,Caffe Mocha,107.0,-6.0,10.0,100.0,Achieved
576,2021-01-01,M3,Mumbai,Caffe Mocha,105.0,6.0,20.0,100.0,Achieved
648,2021-01-01,B1,Banglore,Caffe Mocha,39.0,9.0,10.0,30.0,Achieved
720,2021-01-01,B2,Banglore,Caffe Mocha,44.0,13.0,20.0,40.0,Achieved
792,2021-01-01,H1,Hyderabad,Caffe Mocha,228.0,135.0,140.0,270.0,Not Achieved
864,2021-01-01,M1,Mumbai,Chamomile,341.0,99.0,110.0,300.0,Achieved
936,2021-01-01,M2,Mumbai,Chamomile,130.0,45.0,50.0,110.0,Achieved
1008,2021-01-01,M3,Mumbai,Chamomile,322.0,92.0,110.0,260.0,Achieved
1080,2021-01-01,B1,Banglore,Chamomile,185.0,98.0,80.0,150.0,Achieved
1152,2021-01-01,B2,Banglore,Chamomile,288.0,112.0,80.0,250.0,Achieved
1224,2021-01-01,M1,Mumbai,Colombian,190.0,68.0,80.0,190.0,Achieved
1296,2021-01-01,M2,Mumbai,Colombian,125.0,27.0,40.0,110.0,Achieved
1368,2021-01-01,M3,Mumbai,Colombian,664.0,563.0,560.0,630.0,Achieved
1440,2021-01-01,B1,Banglore,Colombian,74.0,-4.0,10.0,80.0,Not Achieved
1512,2021-01-01,B2,Banglore,Colombian,67.0,9.0,20.0,60.0,Achieved
1584,2021-01-01,H1,Hyderabad,Colombian,197.0,98.0,80.0,200.0,Not Achieved
1656,2021-01-01,M1,Mumbai,Darjeeling,130.0,17.0,20.0,110.0,Achieved
1728,2021-01-01,M2,Mumbai,Darjeeling,92.0,14.0,20.0,80.0,Achieved
1800,2021-01-01,B1,Banglore,Darjeeling,120.0,13.0,30.0,80.0,Achieved
1872,2021-01-01,B2,Banglore,Darjeeling,87.0,13.0,10.0,70.0,Achieved
1944,2021-01-01,H1,Hyderabad,Darjeeling,114.0,17.0,20.0,100.0,Achieved
2016,2021-01-01,M1,Mumbai,Decaf Espresso,180.0,53.0,80.0,210.0,Not Achieved
2088,2021-01-01,M2,Mumbai,Decaf Espresso,210.0,88.0,90.0,180.0,Achieved
2160,2021-01-01,M3,Mumbai,Decaf Espresso,76.0,21.0,30.0,80.0,Not Achieved
2232,2021-01-01,B1,Banglore,Decaf Espresso,235.0,104.0,70.0,180.0,Achieved
2304,2021-01-01,B2,Banglore,Decaf Espresso,168.0,65.0,60.0,160.0,Achieved
2376,2021-01-01,H1,Hyderabad,Decaf Espresso,215.0,89.0,90.0,180.0,Achieved
2448,2021-01-01,M1,Mumbai,Decaf Irish Cream,234.0,101.0,110.0,240.0,Not Achieved
2520,2021-01-01,M2,Mumbai,Decaf Irish Cream,204.0,62.0,80.0,210.0,Not Achieved
2592,2021-01-01,M3,Mumbai,Decaf Irish Cream,265.0,116.0,150.0,260.0,Achieved
2664,2021-01-01,B1,Banglore,Decaf Irish Cream,192.0,74.0,60.0,180.0,Achieved
2736,2021-01-01,B2,Banglore,Decaf Irish Cream,309.0,192.0,150.0,320.0,Not Achieved
2808,2021-01-01,M1,Mumbai,Earl Grey,140.0,36.0,40.0,120.0,Achieved
2880,2021-01-01,M3,Mumbai,Earl Grey,109.0,23.0,20.0,90.0,Achieved
2952,2021-01-01,B2,Banglore,Earl Grey,157.0,56.0,40.0,120.0,Achieved
3024,2021-01-01,H1,Hyderabad,Earl Grey,108.0,32.0,20.0,90.0,Achieved
3096,2021-01-01,M2,Mumbai,Earl Grey,192.0,76.0,60.0,170.0,Achieved
3168,2021-01-01,M1,Mumbai,Green Tea,100.0,30.0,30.0,80.0,Achieved
3240,2021-01-01,M2,Mumbai,Green Tea,94.0,27.0,30.0,80.0,Achieved
3312,2021-01-01,B2,Banglore,Green Tea,112.0,47.0,30.0,80.0,Achieved
3384,2021-01-01,H1,Hyderabad,Green Tea,93.0,37.0,30.0,80.0,Achieved
3456,2021-01-01,M3,Mumbai,Green Tea,121.0,36.0,50.0,90.0,Achieved
3528,2021-01-01,M1,Mumbai,Lemon Tea,150.0,0.0,20.0,130.0,Achieved
3600,2021-01-01,M2,Mumbai,Lemon Tea,79.0,-3.0,10.0,60.0,Achieved
3672,2021-01-01,M3,Mumbai,Lemon Tea,109.0,9.0,20.0,80.0,Achieved
3744,2021-01-01,B1,Banglore,Lemon Tea,412.0,138.0,130.0,380.0,Achieved
3816,2021-01-01,B2,Banglore,Lemon Tea,285.0,151.0,110.0,230.0,Achieved
3888,2021-01-01,H1,Hyderabad,Lemon Tea,94.0,-14.0,0.0,80.0,Achieved
3960,2021-01-01,M1,Mumbai,Mint Tea,140.0,33.0,40.0,120.0,Achieved
4032,2021-01-01,M2,Mumbai,Mint Tea,123.0,26.0,50.0,90.0,Achieved
4104,2021-01-01,M3,Mumbai,Mint Tea,109.0,29.0,20.0,90.0,Achieved
4176,2021-01-01,M1,Mumbai,Regular Espresso,341.0,100.0,110.0,330.0,Achieved

###### Ex. Extract data for year 2021- jan

In [139]:
df[df.Date == "2021-01"]

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Target Status
0,2021-01-01,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not Achieved
72,2021-01-01,M2,Mumbai,Amaretto,302.0,133.0,160.0,300.0,Achieved
144,2021-01-01,M3,Mumbai,Amaretto,254.0,153.0,120.0,260.0,Not Achieved
216,2021-01-01,M1,Mumbai,Caffe Latte,180.0,53.0,50.0,150.0,Achieved
288,2021-01-01,M2,Mumbai,Caffe Latte,150.0,39.0,40.0,120.0,Achieved
360,2021-01-01,B1,Banglore,Caffe Latte,159.0,61.0,50.0,130.0,Achieved
432,2021-01-01,M1,Mumbai,Caffe Mocha,134.0,54.0,70.0,150.0,Not Achieved
504,2021-01-01,M2,Mumbai,Caffe Mocha,107.0,-6.0,10.0,100.0,Achieved
576,2021-01-01,M3,Mumbai,Caffe Mocha,105.0,6.0,20.0,100.0,Achieved
648,2021-01-01,B1,Banglore,Caffe Mocha,39.0,9.0,10.0,30.0,Achieved
720,2021-01-01,B2,Banglore,Caffe Mocha,44.0,13.0,20.0,40.0,Achieved
792,2021-01-01,H1,Hyderabad,Caffe Mocha,228.0,135.0,140.0,270.0,Not Achieved
864,2021-01-01,M1,Mumbai,Chamomile,341.0,99.0,110.0,300.0,Achieved
936,2021-01-01,M2,Mumbai,Chamomile,130.0,45.0,50.0,110.0,Achieved
1008,2021-01-01,M3,Mumbai,Chamomile,322.0,92.0,110.0,260.0,Achieved
1080,2021-01-01,B1,Banglore,Chamomile,185.0,98.0,80.0,150.0,Achieved
1152,2021-01-01,B2,Banglore,Chamomile,288.0,112.0,80.0,250.0,Achieved
1224,2021-01-01,M1,Mumbai,Colombian,190.0,68.0,80.0,190.0,Achieved
1296,2021-01-01,M2,Mumbai,Colombian,125.0,27.0,40.0,110.0,Achieved
1368,2021-01-01,M3,Mumbai,Colombian,664.0,563.0,560.0,630.0,Achieved
1440,2021-01-01,B1,Banglore,Colombian,74.0,-4.0,10.0,80.0,Not Achieved
1512,2021-01-01,B2,Banglore,Colombian,67.0,9.0,20.0,60.0,Achieved
1584,2021-01-01,H1,Hyderabad,Colombian,197.0,98.0,80.0,200.0,Not Achieved
1656,2021-01-01,M1,Mumbai,Darjeeling,130.0,17.0,20.0,110.0,Achieved
1728,2021-01-01,M2,Mumbai,Darjeeling,92.0,14.0,20.0,80.0,Achieved
1800,2021-01-01,B1,Banglore,Darjeeling,120.0,13.0,30.0,80.0,Achieved
1872,2021-01-01,B2,Banglore,Darjeeling,87.0,13.0,10.0,70.0,Achieved
1944,2021-01-01,H1,Hyderabad,Darjeeling,114.0,17.0,20.0,100.0,Achieved
2016,2021-01-01,M1,Mumbai,Decaf Espresso,180.0,53.0,80.0,210.0,Not Achieved
2088,2021-01-01,M2,Mumbai,Decaf Espresso,210.0,88.0,90.0,180.0,Achieved
2160,2021-01-01,M3,Mumbai,Decaf Espresso,76.0,21.0,30.0,80.0,Not Achieved
2232,2021-01-01,B1,Banglore,Decaf Espresso,235.0,104.0,70.0,180.0,Achieved
2304,2021-01-01,B2,Banglore,Decaf Espresso,168.0,65.0,60.0,160.0,Achieved
2376,2021-01-01,H1,Hyderabad,Decaf Espresso,215.0,89.0,90.0,180.0,Achieved
2448,2021-01-01,M1,Mumbai,Decaf Irish Cream,234.0,101.0,110.0,240.0,Not Achieved
2520,2021-01-01,M2,Mumbai,Decaf Irish Cream,204.0,62.0,80.0,210.0,Not Achieved
2592,2021-01-01,M3,Mumbai,Decaf Irish Cream,265.0,116.0,150.0,260.0,Achieved
2664,2021-01-01,B1,Banglore,Decaf Irish Cream,192.0,74.0,60.0,180.0,Achieved
2736,2021-01-01,B2,Banglore,Decaf Irish Cream,309.0,192.0,150.0,320.0,Not Achieved
2808,2021-01-01,M1,Mumbai,Earl Grey,140.0,36.0,40.0,120.0,Achieved
2880,2021-01-01,M3,Mumbai,Earl Grey,109.0,23.0,20.0,90.0,Achieved
2952,2021-01-01,B2,Banglore,Earl Grey,157.0,56.0,40.0,120.0,Achieved
3024,2021-01-01,H1,Hyderabad,Earl Grey,108.0,32.0,20.0,90.0,Achieved
3096,2021-01-01,M2,Mumbai,Earl Grey,192.0,76.0,60.0,170.0,Achieved
3168,2021-01-01,M1,Mumbai,Green Tea,100.0,30.0,30.0,80.0,Achieved
3240,2021-01-01,M2,Mumbai,Green Tea,94.0,27.0,30.0,80.0,Achieved
3312,2021-01-01,B2,Banglore,Green Tea,112.0,47.0,30.0,80.0,Achieved
3384,2021-01-01,H1,Hyderabad,Green Tea,93.0,37.0,30.0,80.0,Achieved
3456,2021-01-01,M3,Mumbai,Green Tea,121.0,36.0,50.0,90.0,Achieved
3528,2021-01-01,M1,Mumbai,Lemon Tea,150.0,0.0,20.0,130.0,Achieved
3600,2021-01-01,M2,Mumbai,Lemon Tea,79.0,-3.0,10.0,60.0,Achieved
3672,2021-01-01,M3,Mumbai,Lemon Tea,109.0,9.0,20.0,80.0,Achieved
3744,2021-01-01,B1,Banglore,Lemon Tea,412.0,138.0,130.0,380.0,Achieved
3816,2021-01-01,B2,Banglore,Lemon Tea,285.0,151.0,110.0,230.0,Achieved
3888,2021-01-01,H1,Hyderabad,Lemon Tea,94.0,-14.0,0.0,80.0,Achieved
3960,2021-01-01,M1,Mumbai,Mint Tea,140.0,33.0,40.0,120.0,Achieved
4032,2021-01-01,M2,Mumbai,Mint Tea,123.0,26.0,50.0,90.0,Achieved
4104,2021-01-01,M3,Mumbai,Mint Tea,109.0,29.0,20.0,90.0,Achieved
4176,2021-01-01,M1,Mumbai,Regular Espresso,341.0,100.0,110.0,330.0,Achieved

###### Ex. Extract data for Jan-Feb_Mar_Apr 2021

In [140]:
df[df.Date.between("2021-01", "2021-04")]

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Target Status
0,2021-01-01,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not Achieved
1,2021-02-01,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0,Achieved
2,2021-03-01,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0,Not Achieved
3,2021-04-01,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0,Achieved
72,2021-01-01,M2,Mumbai,Amaretto,302.0,133.0,160.0,300.0,Achieved
...,...,...,...,...,...,...,...,...,...
4107,2021-04-01,M3,Mumbai,Mint Tea,196.0,-226.0,0.0,150.0,Achieved
4176,2021-01-01,M1,Mumbai,Regular Espresso,341.0,100.0,110.0,330.0,Achieved
4177,2021-02-01,M1,Mumbai,Regular Espresso,490.0,175.0,200.0,480.0,Achieved
4178,2021-03-01,M1,Mumbai,Regular Espresso,65.0,-8.0,0.0,60.0,Achieved
4179,2021-04-01,M1,Mumbai,Regular Espresso,340.0,99.0,110.0,330.0,Achieved

###### Ex. Extract Year and Month from the date column

In [145]:
df.insert(1, "Year", df.Date.dt.year)
df.insert(2, "Month#", df.Date.dt.month)
df.insert(3, "Month", df.Date.dt.month_name())
df.head()

,Date,Year,Month#,Month,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Target Status
0,2021-01-01,2021,1,January,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not Achieved
1,2021-02-01,2021,2,February,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0,Achieved
2,2021-03-01,2021,3,March,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0,Not Achieved
3,2021-04-01,2021,4,April,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0,Achieved
4,2021-05-01,2021,5,May,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0,Achieved

#### Replace Values

###### Ex. Replace city Mumbai with Bombay

In [149]:
df["City"].unique()

array(['Mumbai', 'Banglore', 'Hyderabad'], dtype=object)

In [148]:
df["City"].replace({"Mumbai" : "Bombay"}).unique()

array(['Bombay', 'Banglore', 'Hyderabad'], dtype=object)

#### Sorting Dafatrame
- df.sort_values(`ascending=True`, `inplace=False`, `na_position = {"first","last"}`)
- df.sort_index(`ascending=True`, `inplace=False`)

In [151]:
df.sort_values("Sales", ascending=False)

,Date,Year,Month#,Month,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Target Status
1351,2025-08-01,2025,8,August,M2,Mumbai,Colombian,912.0,370.0,530.0,1140.0,Not Achieved
1349,2025-06-01,2025,6,June,M2,Mumbai,Colombian,912.0,370.0,370.0,860.0,Achieved
1371,2021-04-01,2021,4,April,M3,Mumbai,Colombian,910.0,368.0,520.0,1130.0,Not Achieved
1369,2021-02-01,2021,2,February,M3,Mumbai,Colombian,910.0,368.0,370.0,860.0,Achieved
1591,2021-08-01,2021,8,August,H1,Hyderabad,Colombian,904.0,511.0,530.0,1140.0,Not Achieved
...,...,...,...,...,...,...,...,...,...,...,...,...
3320,2021-09-01,2021,9,September,B2,Banglore,Green Tea,19.0,-552.0,0.0,0.0,Achieved
3272,2023-09-01,2023,9,September,M2,Mumbai,Green Tea,19.0,-430.0,0.0,0.0,Achieved
3368,2025-09-01,2025,9,September,B2,Banglore,Green Tea,18.0,-524.0,0.0,0.0,Achieved
3224,2025-09-01,2025,9,September,M1,Mumbai,Green Tea,18.0,-380.0,0.0,0.0,Achieved
3176,2021-09-01,2021,9,September,M1,Mumbai,Green Tea,17.0,-354.0,0.0,0.0,Achieved

#### Ranking Dataframe
- df[col].rank(`ascending=False`, `method={"average","min","dense"}`, `na_option = {"top","bottom"}`)

In [153]:
df["Sales"].rank(ascending=True)

0       3072.0
1       2166.5
2       2255.5
3        138.5
4       1596.5
         ...
4243    4215.0
4244     699.0
4245    3717.5
4246    4210.0
4247     188.0
Name: Sales, Length: 4248, dtype: float64

In [146]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os
# os.chdir("./datasets")

plt.rcParams["figure.figsize"] = (4, 3)

df = pd.read_csv("coffee_sales.csv", header=3)
df.dropna(axis = 1, how = "all", inplace = True)
df.fillna({"Target Profit": "0"}, inplace=True) 

df.Sales = df.Sales.str.replace("$", "").astype(float)
df.Profit = df.Profit.str.replace("$", "").astype(float)
df["Target Profit"] = df["Target Profit"].str.replace("$", "").astype(float)
df["Target Sales"] = df["Target Sales"].str.replace("$", "").str.replace(",", "").astype(float)
df["Target Status"] = np.where(df.Sales >= df["Target Sales"], "Achieved", "Not Achieved")

df["Date"] = pd.to_datetime(df.Date, format= "mixed")
df.insert(1, "Year", df.Date.dt.year)
df.insert(2, "Month#", df.Date.dt.month)
df.insert(3, "Month", df.Date.dt.month_name())

df.head()

,Date,Year,Month#,Month,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Target Status
0,2021-01-01,2021,1,January,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not Achieved
1,2021-02-01,2021,2,February,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0,Achieved
2,2021-03-01,2021,3,March,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0,Not Achieved
3,2021-04-01,2021,4,April,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0,Achieved
4,2021-05-01,2021,5,May,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0,Achieved

## Visual Analytics 
### (using  combination of **`pandas and seaborn`**)
#### Type of variables -
    - Numeric Variable
    - Categorial Variable

### 1. Univariate Analysis 

#### A. Categorial Column

###### Ex. How many products are there in the dataset?

###### Ex. Visualise the frequency of achieved targets versus unachieved targets

#### B. Numeric Column

**1. Descriptive Statistics**
- Mean: The average value of the column.
- Median: The middle value when the column values are sorted.
- Mode: The most frequently occurring value.
- Standard Deviation: A measure of the amount of variation or dispersion.
- Variance: The square of the standard deviation.
- Range: The difference between the maximum and minimum values.
- Minimum and Maximum: The smallest and largest values in the column.
- Quartiles: Values that divide the data into four equal parts (Q1, Q2, Q3).

**2. Distribution Analysis**
- Histogram: A graphical representation of the distribution of the data.
- Density Plot: A smoothed version of the histogram.
- Box Plot: A graphical representation showing the distribution of the data based on the five-number summary (minimum, Q1, median, Q3, maximum).

**3. Measures of Shape**
- Skewness: Indicates the asymmetry of the distribution.
- Kurtosis: Indicates the peakedness of the distribution.

**4. Identifying Outliers**
- QR Method: Outliers are identified using the Interquartile Range (Q3 - Q1).
- Z-Score Method: Outliers are identified based on the Z-score (number of standard deviations from the mean).

### 2. Bi-Variate Analysis

#### A. Numeric-Categorial

**1. Descriptive Statistics**
- Mean: Calculate the mean of the numeric column for each category.
- Median: Determine the median of the numeric column for each category.
- Standard Deviation: Measure the dispersion of the numeric column within each category.
- Count: Count the number of observations in each category.

**2. Visualization**
- Box Plot: Visualize the distribution of the numeric variable across different categories. (Adding hue component)
- Bar Plot with Error Bars: Show the mean of the numeric variable with error bars representing the standard deviation or standard error.
- Line chart: To visualise Time series data

`df.groupby(by=None, as_index=True, sort=True, dropna=True)`

###### Ex. Create a table representing total sales by product

###### Ex. Create a table representing total sales and profit by product

###### Ex. Create a table representing total sales and avg profit by product

###### Ex. Create a table representing total sales over years and month

###### Ex. Create a line chart using seaborn visualising sales on months and years - Trend

###### Ex. Create a line chart using seaborn visualising sales agg on months - Sesonality

#### B. Numeric - Numeric

- Scatter Plot
- Regression Plot
- Pairplot
- Correlation matrix and Heatmap

###### Ex. Create a Scatter plot visualize correlation between Sales and Profit

###### Ex. Create a Scatter plot visualize correlation between Sales and Profit and a trend line

#### C. Categorial - Catergorial/Numeric/both

- Table chart
- Matrix chart - pivot_table()

  `df.pivot_table(index, columns, values, aggfunc, fill_value)`

###### Ex. Display total sales by product and city - matrix chart

###### Ex. How many franchises in each city are selling each product?

<hr><hr>